app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("category", "created_at", "id", "parent_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category", "News"], ["created_at", Sun, 06 Oct 2013 07:31:05 UTC +00:00], ["id", 1], ["parent_id", 0], ["updated_at", Sun, 06 Oct 2013 07:31:05 UTC +00:00]]