app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 5) #Post.all
---
SELECT "posts".* FROM "posts" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("category_id", "content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["content", "ini adalah artikel news"], ["created_at", Sun, 06 Oct 2013 07:38:00 UTC +00:00], ["title", "first article"], ["updated_at", Sun, 06 Oct 2013 07:38:00 UTC +00:00]]